[{"title":"Berry Parfait","prepTime":"15","tags[]":["vegetarian","gluten-free","nut-free","mediterranean","breakfast","snack","dessert"],"ingredients":"1 cup Greek yogurt\r\n1 cup mixed berries (such as strawberries, blueberries, raspberries)\r\n2 tablespoons honey or maple syrup\r\n1/4 cup granola or crushed graham crackers\r\nFresh mint leaves for garnish (optional)","steps":"1. Prepare the Berries:\r\n        Rinse the mixed berries under cold water and pat them dry with a paper towel.\r\n        If using strawberries, hull and slice them into bite-sized pieces. Leave smaller berries whole.\r\n\r\n2. Sweeten the Yogurt:\r\n        In a small bowl, mix the Greek yogurt with honey or maple syrup until well combined. Adjust sweetness to taste.\r\n\r\n3. Assemble the Parfaits:\r\n        Start by layering a spoonful of sweetened Greek yogurt into the bottom of serving glasses or bowls.\r\n        Add a layer of mixed berries on top of the yogurt.\r\n        Sprinkle a layer of granola or crushed graham crackers over the berries.\r\n        Repeat the layers until the glasses or bowls are filled, ending with a final layer of yogurt on top.\r\n\r\n4. Garnish and Serve:\r\n        Garnish the parfaits with fresh mint leaves if desired.\r\n        Serve immediately or chill in the refrigerator for a few minutes before serving to let the flavors meld together.\r\n\r\n5. Enjoy!\r\n        Enjoy your quick and delicious berry parfaits as a light and refreshing dessert or snack.","imageName":"12.jpg","user":"Aria","id":12},{"title":"Homemade Dumplings","prepTime":"90","tags[]":["nut-free","dairy-free","chinese","lunch","dinner","snack"],"ingredients":"2 cups all-purpose flour\r\n3/4 cup warm water\r\n1/2 teaspoon salt\r\n\r\n1/2 lb ground pork (or chicken, beef, or tofu for vegetarian option)\r\n1 cup finely chopped cabbage\r\n2 green onions, finely chopped\r\n2 cloves garlic, minced\r\n1 tablespoon soy sauce\r\n1 tablespoon sesame oil\r\n1 teaspoon grated ginger\r\nSalt and pepper, to taste\r\n\r\nWater, for boiling\r\nSoy sauce, vinegar, sesame oil, chili oil, or your favorite dipping sauce","steps":"1. Prepare the Dumpling Dough:\r\n\r\n    In a large mixing bowl, combine the all-purpose flour and salt.\r\n    Gradually add warm water to the flour mixture while stirring until a dough forms.\r\n    Knead the dough on a lightly floured surface for about 5-7 minutes until it becomes smooth and elastic.\r\n    Cover the dough with a damp cloth or plastic wrap and let it rest for 30 minutes.\r\n\r\n2. Prepare the Dumpling Filling:\r\n\r\n    In a separate mixing bowl, combine the ground pork, chopped cabbage, green onions, minced garlic, soy sauce, sesame oil, grated ginger, salt, and pepper.\r\n    Mix the ingredients until well combined. Adjust seasoning to taste if needed.\r\n\r\n3. Form the Dumplings:\r\n\r\n    After the dough has rested, divide it into small portions, about the size of a walnut.\r\n    Roll each portion into a thin circle, about 3-4 inches in diameter, using a rolling pin.\r\n    Place a spoonful of the filling in the center of each dough circle.\r\n    Fold the dough over the filling to create a half-moon shape and pinch the edges together to seal. You can also crimp the edges for decoration if desired.\r\n    Repeat this process until all the dough and filling are used, making as many dumplings as desired.\r\n\r\n4. Cook the Dumplings:\r\n\r\n    Bring a large pot of water to a boil.\r\n    Carefully add the dumplings to the boiling water, making sure they are not overcrowded in the pot. You may need to cook them in batches.\r\n    Gently stir the dumplings with a spoon to prevent them from sticking to the bottom of the pot.\r\n    Boil the dumplings for about 5-7 minutes, or until they float to the surface and the dough is cooked through.\r\n\r\n5. Serve the Dumplings:\r\n\r\n    Using a slotted spoon, remove the cooked dumplings from the pot and drain excess water.\r\n    Serve the dumplings hot with your favorite dipping sauce, such as soy sauce, vinegar, sesame oil, or chili oil.","imageName":"11.jpeg","user":"Liam","id":11},{"title":"Avocado Tomato Salad","prepTime":"15","tags[]":["vegan","vegetarian","gluten-free","nut-free","dairy-free","mediterranean","mexican","lunch","dinner","snack"],"ingredients":"2 ripe avocados, diced\r\n2 large tomatoes, diced\r\n1/4 red onion, thinly sliced\r\n1/4 cup chopped fresh cilantro (coriander)\r\n1 tablespoon extra-virgin olive oil\r\n1 tablespoon freshly squeezed lime juice\r\nSalt and pepper, to taste\r\nOptional: chopped jalapeño or red chili flakes for heat","steps":"1. Prepare the Ingredients:\r\n        Dice the ripe avocados and tomatoes into bite-sized pieces.\r\n        Thinly slice the red onion.\r\n        Chop the fresh cilantro.\r\n\r\n2. Assemble the Salad:\r\n        In a large mixing bowl, combine the diced avocados, tomatoes, sliced red onion, and chopped cilantro.\r\n        If using, add chopped jalapeño or red chili flakes for heat.\r\n\r\n3. Dress the Salad:\r\n        Drizzle extra-virgin olive oil and freshly squeezed lime juice over the salad.\r\n        Season with salt and pepper to taste.\r\n\r\n4. Toss and Serve:\r\n        Gently toss all the ingredients together until well combined and evenly coated with the dressing.\r\n\r\n5. Serve Immediately:\r\n        Transfer the avocado and tomato salad to serving plates or a serving bowl.\r\n        Serve immediately as a refreshing side dish or light lunch.","imageName":"10.jpg","user":"Sophia","id":10},{"title":"English Breakfast","prepTime":"30","tags[]":["gluten-free","nut-free","dairy-free","breakfast"],"ingredients":"4 large eggs\r\nSalt and pepper, to taste\r\nButter or oil for frying\r\n4 pork sausages\r\n1 can (400g) baked beans\r\n8 large mushrooms, cleaned and sliced\r\n2 cloves garlic, minced\r\n2 tablespoons butter\r\nSalt and pepper, to taste\r\nFresh parsley, chopped (optional)\r\n4 slices of ham\r\n4 slices of bread","steps":"1. Cook the Sausages:\r\n        Preheat the oven to 400°F (200°C).\r\n        Place the sausages on a baking sheet and roast in the oven for 20-25 minutes, turning halfway through, until cooked through and browned.\r\n\r\n2. Prepare the Mushrooms:\r\n        Heat butter in a skillet over medium heat. Add minced garlic and sauté for 1 minute until fragrant.\r\n        Add sliced mushrooms to the skillet and cook for 5-7 minutes, stirring occasionally, until they are tender and golden brown.\r\n        Season with salt, pepper, and chopped parsley if desired. Keep warm.\r\n\r\n3. Cook the Eggs:\r\n        Heat butter or oil in a non-stick skillet over medium heat.\r\n        Crack the eggs into the skillet and cook to your desired doneness, either fried, scrambled, or poached.\r\n        Season with salt and pepper.\r\n\r\n4. Heat the Baked Beans:\r\n        Transfer the baked beans to a saucepan and heat gently over low heat until hot.\r\n\r\n5. Warm the Ham:\r\n        Heat the slices of ham in a skillet or in the oven for a few minutes until warmed through.\r\n\r\n6. Toast the Bread:\r\n        Toast the slices of bread until golden brown.\r\n\r\n7. Assemble the English Breakfast:\r\n        Arrange the cooked sausages, eggs, mushrooms, beans, ham, and toast on serving plates.\r\n        Serve hot with your choice of condiments such as ketchup, HP sauce, or Worcestershire sauce.","imageName":"9.jpg","user":"Owen","id":9},{"title":"Neapolitan Pizza","prepTime":"120","tags[]":["vegan","vegetarian","nut-free","mediterranean","lunch","dinner"],"ingredients":"3 1/2 cups (500g) Italian 00 flour or bread flour\r\n1 1/2 cups (350ml) lukewarm water\r\n2 teaspoons salt\r\n1/2 teaspoon active dry yeast\r\n1 tablespoon extra-virgin olive oil\r\n\r\n1 1/2 cups (360ml) San Marzano tomato sauce\r\n8 oz (225g) fresh mozzarella cheese, sliced\r\nFresh basil leaves\r\nExtra-virgin olive oil, for drizzling\r\nSalt and pepper, to taste","steps":"1. Prepare the Pizza Dough:\r\n        In a large mixing bowl, combine the flour and salt. Dissolve the yeast in lukewarm water and let it sit for a few minutes until frothy.\r\n        Make a well in the center of the flour mixture and pour in the yeast mixture and olive oil.\r\n        Mix the ingredients until a shaggy dough forms, then transfer the dough to a lightly floured surface.\r\n        Knead the dough for about 8-10 minutes until it becomes smooth and elastic.\r\n        Shape the dough into a ball and place it in a lightly oiled bowl. Cover with plastic wrap or a clean kitchen towel and let it rise in a warm place for about 1 1/2 to 2 hours, or until doubled in size.\r\n\r\n2. Preheat the Oven and Prepare the Pizza:\r\n        Preheat your oven to its highest temperature, typically around 500-550°F (260-290°C), and place a pizza stone or baking sheet inside to heat up.\r\n\r\n3. Shape and Top the Pizza:\r\n        Once the dough has risen, punch it down and divide it into two equal portions for two pizzas.\r\n        On a lightly floured surface, shape each portion of dough into a round ball, then gently flatten and stretch it into a thin circle, about 10-12 inches (25-30cm) in diameter.\r\n        Transfer the stretched dough to a piece of parchment paper dusted with cornmeal or flour to prevent sticking.\r\n        Spread half of the tomato sauce evenly over each pizza dough, leaving a small border around the edges.\r\n        Arrange slices of fresh mozzarella cheese on top of the sauce.\r\n        Tear fresh basil leaves and scatter them over the cheese.\r\n        Drizzle with a little extra-virgin olive oil and season with salt and pepper to taste.\r\n\r\n4.  Bake the Pizza:\r\n        Carefully slide the pizzas, along with the parchment paper, onto the preheated pizza stone or baking sheet in the oven.\r\n        Bake for about 8-10 minutes, or until the crust is golden brown and the cheese is bubbly and melted.\r\n\r\n5. Serve:\r\n        Once baked, remove the pizzas from the oven and let them cool for a minute or two.\r\n        Slice the pizzas into wedges and serve hot, garnished with additional fresh basil leaves if desired.","imageName":"8.jpg","user":"Isaac","id":8},{"title":"Gulab Jamun","prepTime":"90","tags[]":["vegetarian","nut-free","mediterranean","indian","snack","dessert"],"ingredients":"1 cup full-fat milk powder\r\n1/4 cup all-purpose flour (maida)\r\n1/4 teaspoon baking powder\r\n2 tablespoons ghee (clarified butter), melted\r\n2-3 tablespoons milk, as needed to form a dough\r\nOil or ghee, for deep frying\r\n\r\n1 cup sugar\r\n1 cup water\r\n3-4 green cardamom pods, crushed\r\nA few saffron strands (optional)\r\n1 teaspoon rose water or a few drops of rose essence (optional)","steps":"1. Prepare the Sugar Syrup (Gulab):\r\n        In a saucepan, combine sugar, water, crushed cardamom pods, and saffron strands (if using).\r\n        Bring the mixture to a boil over medium heat, stirring until the sugar is completely dissolved.\r\n        Simmer the syrup for 5-7 minutes until it slightly thickens. Remove from heat and stir in the rose water or rose essence. Set aside to cool.\r\n\r\n2. Prepare the Gulab Jamun Dough:\r\n        In a mixing bowl, combine milk powder, all-purpose flour, and baking powder.\r\n        Add melted ghee to the dry ingredients and mix well.\r\n        Gradually add milk, a little at a time, and knead the mixture into a soft dough. The dough should be smooth and slightly sticky.\r\n        Cover the dough with a damp cloth or plastic wrap and let it rest for 10-15 minutes.\r\n\r\n3. Shape the Gulab Jamun Balls:\r\n        After resting, knead the dough again for a few seconds.\r\n        Divide the dough into small portions and roll each portion between your palms to form smooth, crack-free balls. Make sure there are no cracks on the surface of the balls, as they may break during frying.\r\n        The size of the balls can vary according to preference, but they should be smaller than the size of a ping pong ball, as they will expand slightly after frying.\r\n\r\n4. Fry the Gulab Jamun:\r\n        Heat oil or ghee in a deep frying pan or kadai over medium-low heat. The oil should be hot but not smoking.\r\n        Gently slide the shaped Gulab Jamun balls into the hot oil, a few at a time, without overcrowding the pan.\r\n        Fry the balls on low to medium-low heat, stirring gently and continuously to ensure even cooking and browning. The balls will gradually increase in size and turn golden brown.\r\n        Once the Gulab Jamun balls are evenly golden brown, remove them from the oil using a slotted spoon and drain excess oil by placing them on a plate lined with paper towels.\r\n\r\n5. Soak the Gulab Jamun:\r\n        While the Gulab Jamun balls are still warm, carefully transfer them to the prepared sugar syrup (Gulab).\r\n        Allow the Gulab Jamun balls to soak in the syrup for at least 1-2 hours before serving. During this time, they will absorb the syrup and become soft, moist, and flavorful.\r\n\r\n6. Serve the Gulab Jamun:\r\n        Gulab Jamun can be served warm or at room temperature.\r\n        Garnish with chopped nuts like almonds or pistachios if desired.\r\n        Enjoy the delicious and indulgent Gulab Jamun as a festive dessert or sweet treat!","imageName":"7.png","user":"Jinx","id":7},{"title":"Falafel","prepTime":"30","tags[]":["vegan","vegetarian","gluten-free","nut-free","dairy-free","mediterranean","middleeast","breakfast","lunch","dinner","snack"],"ingredients":"1 cup dried chickpeas (garbanzo beans), soaked overnight\r\n1 small onion, chopped\r\n3 cloves garlic, minced\r\n1/4 cup chopped fresh parsley\r\n1/4 cup chopped fresh cilantro\r\n1 teaspoon ground cumin\r\n1 teaspoon ground coriander\r\n1/2 teaspoon baking soda\r\nSalt and pepper, to taste\r\nVegetable oil, for frying","steps":"1. Soak the Chickpeas:\r\n        Place the dried chickpeas in a large bowl and cover them with water. Let them soak overnight, or for at least 8 hours.\r\n\r\n2. Prepare the Falafel Mixture:\r\n        Drain the soaked chickpeas and transfer them to a food processor.\r\n        Add the chopped onion, minced garlic, parsley, cilantro, cumin, coriander, baking soda, salt, and pepper to the food processor.\r\n        Pulse the mixture until it forms a coarse paste with small pieces of chickpeas. You want the mixture to hold together but still have some texture.\r\n\r\n3. Shape the Falafel:\r\n        Scoop out about 1-2 tablespoons of the falafel mixture and shape it into a small ball or patty. Repeat with the remaining mixture.\r\n        You can also use a falafel scoop or spoon to shape the mixture into uniform balls.\r\n\r\n4. Fry the Falafel:\r\n        Heat vegetable oil in a frying pan or deep fryer to 350°F (175°C).\r\n        Carefully add the shaped falafel to the hot oil in batches, making sure not to overcrowd the pan.\r\n        Fry the falafel until golden brown and crispy on the outside, about 3-4 minutes per side.\r\n        Use a slotted spoon to remove the falafel from the oil and transfer them to a plate lined with paper towels to drain any excess oil.\r\n        Repeat until all the falafel are fried.\r\n\r\n5. Serve the Falafel:\r\n        Serve the falafel hot with your favorite accompaniments, such as pita bread, tahini sauce, tzatziki, hummus, chopped tomatoes, cucumbers, and lettuce.\r\n        You can also serve falafel as part of a salad, wrap, or bowl.","imageName":"6.jpg","user":"Zoe","id":6},{"title":"Homemade Samosas","prepTime":"90","tags[]":["vegan","vegetarian","nut-free","dairy-free","indian","lunch","dinner","snack"],"ingredients":"2 cups all-purpose flour\r\n1/4 cup vegetable oil\r\n1/2 teaspoon salt\r\nWater, as needed\r\n\r\n2 large potatoes, boiled, peeled, and mashed\r\n1 cup frozen peas, thawed\r\n1 small onion, finely chopped\r\n2 cloves garlic, minced\r\n1 teaspoon grated ginger\r\n1 green chili, finely chopped (optional)\r\n1 teaspoon cumin seeds\r\n1 teaspoon coriander powder\r\n1/2 teaspoon turmeric powder\r\n1/2 teaspoon garam masala\r\nSalt, to taste\r\n2 tablespoons vegetable oil","steps":"1. Prepare the Dough:\r\n\r\n    Combine 2 cups of all-purpose flour, 1/4 cup of vegetable oil, and 1/2 teaspoon of salt in a large mixing bowl.\r\n    Gradually add water and knead until a smooth, firm dough forms.\r\n    Cover the dough with a damp cloth and let it rest for 30 minutes.\r\n\r\n2. Prepare the Filling:\r\n\r\n    Heat 2 tablespoons of vegetable oil in a large skillet over medium heat.\r\n    Sauté 1 teaspoon of cumin seeds until they splutter.\r\n    Add 1 chopped onion and cook until translucent.\r\n    Stir in 2 cloves of minced garlic, 1 teaspoon of grated ginger, and 1 finely chopped green chili (optional). Sauté for 1 minute.\r\n    Add 1 cup of thawed peas and cook for a couple of minutes.\r\n    Mix in 2 boiled, peeled, and mashed potatoes, along with 1/2 teaspoon each of coriander powder, turmeric powder, and garam masala.\r\n    Season with salt and cook for 5-7 minutes. Remove from heat and let the filling cool.\r\n\r\n3. Assemble the Samosas:\r\n\r\n    Divide the rested dough into equal-sized balls.\r\n    Roll out each ball into a thin oval or circle.\r\n    Cut each rolled-out dough circle in half to form two semi-circles.\r\n    Fold each semi-circle into a cone shape, sealing the edges with water.\r\n    Fill the cones with the cooled potato-pea filling.\r\n    Seal the tops of the cones by pressing the edges together.\r\n\r\n4. Fry the Samosas:\r\n\r\n    Heat vegetable oil in a deep frying pan or pot over medium-high heat.\r\n    Carefully add the stuffed samosas in batches, without overcrowding the pan.\r\n    Fry until golden brown and crispy on all sides, turning occasionally for even cooking.\r\n    Remove from the oil using a slotted spoon and drain on paper towels.","imageName":"5.webp","user":"Indra","id":5},{"title":"Spanakopita","prepTime":"90","tags[]":["vegetarian","nut-free","mediterranean","lunch","dinner"],"ingredients":"1 lb (450g) fresh spinach, washed and chopped (or frozen spinach, thawed and drained)\r\n1 tablespoon olive oil\r\n1 onion, finely chopped\r\n2 cloves garlic, minced\r\n8 oz (225g) feta cheese, crumbled\r\n1/4 cup chopped fresh dill (or 1 tablespoon dried dill)\r\n1/4 cup chopped fresh parsley\r\nSalt and pepper to taste\r\nPinch of nutmeg (optional\r\n\r\n1/2 lb (about 10 sheets) phyllo pastry, thawed if frozen\r\n1/2 cup (1 stick) unsalted butter, melted\r\nOlive oil, for brushing","steps":"1. Preheat your oven to 375°F (190°C). Lightly grease a baking dish with olive oil or non-stick cooking spray.\r\n\r\n2. In a large skillet, heat the olive oil over medium heat. Add the chopped onion and cook until softened, about 3-4 minutes. Add the minced garlic and cook for an additional 1-2 minutes until fragrant.\r\n\r\n3. Add the chopped spinach to the skillet and cook until wilted, stirring occasionally. If using fresh spinach, this may take 3-4 minutes. If using frozen spinach, it may take a bit longer to heat through.\r\n\r\n4. Once the spinach is cooked, transfer it to a large mixing bowl. Let it cool slightly, then add the crumbled feta cheese, chopped dill, chopped parsley, salt, pepper, and nutmeg (if using). Mix until well combined.\r\n\r\n5. Unroll the phyllo pastry sheets and cover them with a damp kitchen towel to prevent them from drying out while you work.\r\n\r\n6. Place one sheet of phyllo pastry in the bottom of the prepared baking dish, allowing the edges to overhang. Brush the sheet lightly with melted butter or olive oil. Repeat this process with 5 more sheets of phyllo, brushing each layer with butter or oil.\r\n\r\n7. Spread the spinach and feta mixture evenly over the layered phyllo pastry in the baking dish.\r\n\r\n8. Layer the remaining sheets of phyllo pastry on top of the spinach mixture, brushing each sheet with melted butter or olive oil as before. Fold the overhanging edges of the bottom sheets over the top layers to seal in the filling.\r\n\r\n9. Brush the top layer of phyllo pastry with melted butter or olive oil.\r\n\r\n10. Using a sharp knife, score the top layer of phyllo pastry into squares or triangles, being careful not to cut all the way through to the bottom.\r\n\r\n11. Bake the spanakopita in the preheated oven for 35-40 minutes, or until the pastry is golden brown and crispy.\r\n\r\nOnce baked, remove the spanakopita from the oven and let it cool for a few minutes before slicing and serving.","imageName":"4.jpg","user":"Nicholas","id":4},{"title":"Homemade Ramen","prepTime":"30","tags[]":["vegan","vegetarian","nut-free","dairy-free","chinese","dinner"],"ingredients":"8 oz ramen noodles (fresh or dried)\r\n2 cups sliced vegetables (such as bok choy, mushrooms, carrots, or spinach)\r\n2 boiled eggs, halved (optional)\r\nSliced green onions, for garnish\r\nSesame seeds, for garnish\r\nChili oil or hot sauce (optional), for extra heat","steps":"1. In a large pot, bring the chicken or vegetable broth to a simmer over medium heat. Add the minced garlic, grated ginger, soy sauce, miso paste (if using), and sesame oil. Stir to combine and let the broth simmer for about 10-15 minutes to allow the flavors to meld.\r\n\r\n2. While the broth is simmering, prepare the ramen noodles according to the package instructions. If using fresh noodles, they typically cook in just a couple of minutes. If using dried noodles, they may take a bit longer, usually around 5-7 minutes. Drain the noodles and set them aside.\r\n\r\n3. In the last 5 minutes of simmering the broth, add the sliced vegetables to the pot. Let them cook until they are tender but still slightly crisp.\r\n\r\n4. Once the broth and vegetables are ready, divide the cooked ramen noodles among serving bowls. Ladle the hot broth and vegetables over the noodles.\r\n\r\n5. Top each bowl of ramen with a boiled egg half, sliced green onions, sesame seeds, and a drizzle of chili oil or hot sauce if desired.\r\n\r\nServe the homemade ramen immediately, and enjoy it while it's hot!","imageName":"3.jpg","user":"Stella","id":3},{"title":"Tacos de Carnitas","prepTime":"120","tags[]":["gluten-free","nut-free","dairy-free","mexican","lunch","dinner"],"ingredients":"2 lbs pork shoulder (also known as pork butt), cut into large chunks\r\n1 onion, quartered\r\n4 cloves garlic, smashed\r\n1 orange, juiced\r\n1 lime, juiced\r\n1 teaspoon ground cumin\r\n1 teaspoon dried oregano\r\n1 teaspoon chili powder\r\n1 teaspoon smoked paprika\r\nSalt, to taste\r\nPepper, to taste\r\n2 tablespoons vegetable oil\r\n\r\nCorn tortillas\r\nChopped onion\r\nChopped cilantro\r\nSalsa (optional)\r\nLime wedges","steps":"1. Preheat your oven to 325°F (160°C).\r\n\r\n2. Season the pork chunks generously with salt and pepper.\r\n\r\n3. In a large Dutch oven or oven-safe pot, heat the vegetable oil over medium-high heat. Once hot, add the pork chunks and sear them on all sides until they are browned and caramelized, about 3-4 minutes per side.\r\n\r\n4. Add the quartered onion, smashed garlic cloves, orange juice, lime juice, cumin, oregano, chili powder, and smoked paprika to the pot with the seared pork.\r\n\r\n5. Cover the pot with a lid and transfer it to the preheated oven. Let the pork cook in the oven for about 2 to 2 ½ hours, or until the meat is very tender and can be easily shredded with a fork.\r\n\r\n6. Once the pork is cooked, remove the pot from the oven. Using two forks, shred the pork into smaller pieces right in the pot, mixing it with the flavorful juices and aromatics.\r\n\r\n7. Heat a skillet over medium heat. Warm the corn tortillas on the skillet for about 30 seconds on each side until they are soft and pliable. Keep the tortillas warm in a clean kitchen towel or tortilla warmer.\r\n\r\n8. To assemble the tacos, place a spoonful of the carnitas onto each warm tortilla. Top with chopped onion, chopped cilantro, and salsa if desired. Squeeze a fresh lime wedge over the top for an extra burst of flavor.\r\n\r\nServe the tacos de carnitas immediately and enjoy!","imageName":"2.jpg","user":"Matthew","id":2},{"title":"Chocolate Chip Cookies","prepTime":"30","tags[]":["vegetarian","nut-free","snack","dessert"],"ingredients":"1/2 cup (1 stick) unsalted butter, softened\r\n1/2 cup granulated sugar\r\n1/4 cup packed brown sugar\r\n1 large egg\r\n1 teaspoon vanilla extract\r\n1 1/4 cups all-purpose flour\r\n1/2 teaspoon baking soda\r\n1/2 teaspoon salt\r\n1 cup semisweet chocolate chips","steps":"1. Preheat your oven to 350°F (175°C). Line a baking sheet with parchment paper or lightly grease it.\r\n\r\n2. In a large mixing bowl, cream together the softened butter, granulated sugar, and brown sugar until smooth and creamy.\r\n\r\n3.  Beat in the egg and vanilla extract until well combined.\r\n\r\n4. In a separate bowl, whisk together the flour, baking soda, and salt.\r\n\r\n5. Gradually add the dry ingredients to the wet ingredients, mixing until a smooth dough forms.\r\n\r\n6. Fold in the chocolate chips until evenly distributed throughout the dough.\r\n\r\n7. Using a spoon or cookie scoop, drop rounded tablespoons of dough onto the prepared baking sheet, spacing them about 2 inches apart.\r\n\r\n8. Bake in the preheated oven for 8-10 minutes, or until the edges are lightly golden brown. The centers may still look slightly soft, but they will continue to set as they cool.\r\n\r\n9. Remove the baking sheet from the oven and let the cookies cool on the pan for a few minutes before transferring them to a wire rack to cool completely.\r\n\r\nOnce cooled, serve and enjoy your delicious homemade chocolate chip cookies!","imageName":"1.jpg","user":"Jinx","id":1}]