[{"title":"TEST","prepTime":"120","tags[]":["vegan","vegetarian","mexican","chinese","snack"],"ingredients":"f","steps":"f","imageName":"4.jpg","user":"jinx","id":4},{"title":"Chocolate Chip Cookies","prepTime":"90","tags[]":["vegetarian","snack","dessert"],"ingredients":"Milk\r\nSugar\r\nFlour\r\nEggs\r\nChocolate Chips","steps":"1. Mix all ingredients\r\n2. Pour onto baking tray\r\n3. Bake\r\n4.Enjoy","imageName":"1.jpg","user":"jinx","id":1},{"title":"Homemade Dumplings","prepTime":"120","tags[]":["nut-free","dairy-free","chinese","lunch","dinner"],"ingredients":"1 cup all-purpose flour\r\n1/2 cup water\r\n1/2 teaspoon salt\r\nFilling of your choice (such as ground pork, chicken, shrimp, or vegetables)\r\nSoy sauce, vinegar, and sesame oil for dipping (optional)","steps":"1.    Prepare the filling: If using ground meat, mix it with your choice of seasonings (such as garlic, ginger, soy sauce, and green onions). If using vegetables, chop them finely and sauté with seasonings until tender. Let the filling cool completely.\r\n\r\n2.    Make the dough: In a mixing bowl, combine the flour and salt. Gradually add water while stirring until a dough forms. Knead the dough on a floured surface for about 5 minutes, or until smooth. Cover the dough with a damp towel and let it rest for 20-30 minutes.\r\n\r\n3.    Roll out the dough: After resting, divide the dough into small pieces and roll each piece into a thin circle (about 3 inches in diameter) using a rolling pin.\r\n\r\n4.    Fill the dumplings: Place a spoonful of filling in the center of each dough circle. Be careful not to overfill.\r\n\r\n    Fold and seal the dumplings: Fold the dough over the filling to create a half-moon shape. Pinch the edges together to seal the dumplings. You can also pleat the edges for a decorative touch.\r\n\r\n    Cook the dumplings: Bring a pot of water to a boil. Carefully add the dumplings to the boiling water and cook for about 3-4 minutes, or until they float to the surface and are cooked through.\r\n\r\n    Serve: Remove the dumplings with a slotted spoon and serve hot with soy sauce, vinegar, and sesame oil for dipping, if desired.","imageName":"2.jpeg","user":"mitch","id":2},{"title":"Tacos de Carnitas","prepTime":"60","tags[]":["gluten-free","nut-free","dairy-free","mexican","lunch","dinner"],"ingredients":"2 lbs pork shoulder, cut into chunks\r\n1 onion, quartered\r\n4 cloves garlic, smashed\r\n2 bay leaves\r\n1 tablespoon dried oregano\r\n1 tablespoon ground cumin\r\n1 teaspoon ground coriander\r\n1 teaspoon chili powder\r\nSalt and pepper to taste\r\n2 cups chicken or pork broth\r\n1 orange, juiced\r\nCorn tortillas\r\nChopped onion\r\nChopped cilantro\r\nSalsa (your favorite kind)\r\nLime wedges\r\nOptional: sliced radishes, avocado slices, shredded lettuce, crumbled queso fresco","steps":"Instructions:\r\n\r\n1.    Season the pork: In a large bowl, season the pork shoulder chunks with salt, pepper, dried oregano, ground cumin, ground coriander, and chili powder. Toss well to coat evenly.\r\n\r\n2.    Sear the pork: Heat a large skillet or Dutch oven over medium-high heat. Add the seasoned pork chunks and sear until browned on all sides, about 5-7 minutes.\r\n\r\n3.    Add aromatics and liquid: Once the pork is browned, add the quartered onion, smashed garlic cloves, bay leaves, chicken or pork broth, and freshly squeezed orange juice to the skillet or Dutch oven. Stir to combine.\r\n\r\n4.    Braise the pork: Reduce the heat to low, cover the skillet or Dutch oven, and let the pork simmer gently for 2-3 hours, or until it is tender and easily shreds with a fork. Check occasionally to make sure there is enough liquid, adding more broth if needed.\r\n\r\n    Shred the pork: Once the pork is tender, use two forks to shred it into bite-sized pieces. Increase the heat to medium-high and continue cooking, uncovered, for another 10-15 minutes, or until the edges of the pork are crispy.\r\n\r\n5.    Assemble the tacos: Warm the corn tortillas on a dry skillet or directly over a flame until soft and pliable. Fill each tortilla with a generous amount of the carnitas. Top with chopped onion, chopped cilantro, salsa, and any other desired toppings. Squeeze fresh lime juice over the top.\r\n\r\n6.    Serve immediately and enjoy your delicious Tacos de Carnitas!\r\n\r\nFeel free to customize your tacos with your favorite toppings and enjoy the rich flavors of homemade carnitas.","imageName":"3.jpg","user":"jinx","id":3}]